// SPDX-License-Identifier: MIT

// Package gb11643 解析身分证详情
package gb11643

import (
	"github.com/issue9/validation/is/gb11643"
)

// 我国现行的身份证号码有两种标准：GB11643-1989、GB11643-1999：
//
// GB11643-1989为一代身份证，从左至右分别为：
//  ------------------------------------------------------------
//  | 6位行政区域代码 | 6位出生年日期（不含世纪数）| 3位顺序码 |
//  ------------------------------------------------------------
//
// GB11643-1999为二代身份证，从左至右分别为：
//  ------------------------------------------------------------
//  | 6位行政区域代码 |  8位出生日期 |  3位顺序码 |  1位检验码 |
//  ------------------------------------------------------------

const layout = "20060102"

// GB11643 身份证信息
type GB11643 = gb11643.GB11643

// Parse 分析身份证信息
//
// 不作正确性检测，如有需求，请使用 is.GB11643
func Parse(bs string) (*GB11643, error) {
	return gb11643.Parse(bs)
}
